[
    {
        "filename": "project_overview.txt.txt",
        "uploaded_by": "vijayashree2k04@gmail.com",
        "upload_date": "2025-12-21 06:12:12",
        "path": "uploaded_docs/project_overview.txt.txt",
        "summary": "Here is a summary of the Centralized Order Processing System project document:\n\n**Summary: Centralized Order Processing System**\n\nThis document outlines the **Centralized Order Processing System** project, which aims to provide an automated, end-to-end solution for managing enterprise client orders.\n\n1.  **Purpose of the Project:**\n    The primary goal is to automate the entire order lifecycle, from intake and validation through fulfillment and reporting, for enterprise clients. The system is critical, as any downtime directly impacts revenue and customer satisfaction for operations teams and external partners.\n\n2.  **Key Processes Described:**\n    The system handles the following core processes:\n    *   **Order Intake:** Orders are received via an API.\n    *   **Validation:** Incoming orders undergo validation.\n    *   **Asynchronous Processing:** Validated orders are sent to Kafka for asynchronous processing.\n    *   **Fulfillment:** Orders are processed towards fulfillment.\n    *   **Data Storage:** Processed order data is stored in a PostgreSQL database.\n    *   **Reporting:** Daily reports are generated from the system data.\n\n3.  **Important Contacts / Ownership:**\n    *   **Product Owner:** Ananya\n    *   **Tech Lead:** Ravi\n    *   **Operations Contact:** Suresh\n\n4.  **Key Decisions Made (Implied by Design):**\n    The architectural and technological choices reflect the key decisions for the system's implementation:\n    *   **Technology Stack:** The system is built using Python with FastAPI for the backend, PostgreSQL for the database, Kafka for messaging, and deployed on Google Cloud Platform (GCP).\n    *   **High-Level Architecture:** An API-first approach for order intake, an asynchronous processing model leveraging Kafka, and a robust database for data persistence were chosen to support the end-to-end order flow and daily reporting.",
        "content": "Project Name: Centralized Order Processing System\n\nPurpose:\nThis project handles end-to-end order processing for enterprise clients. The goal is to automate order intake, validation, fulfillment, and reporting.\n\nBusiness Context:\nThe system is used by operations teams and external partners. Any downtime directly impacts revenue and customer satisfaction.\n\nTech Stack:\n- Backend: Python, FastAPI\n- Database: PostgreSQL\n- Messaging: Kafka\n- Cloud: GCP\n\nHigh-Level Architecture:\nOrders are received via API, validated, sent to Kafka, processed asynchronously, and stored in the database. Reports are generated daily.\n\nStakeholders:\n- Product Owner: Ananya\n- Tech Lead: Ravi\n- Ops Contact: Suresh\n\nTimeline:\nProject started in Jan 2022 and is currently in active development."
    },
    {
        "filename": "Module_ownership.txt",
        "uploaded_by": "vijayashree2k04@gmail.com",
        "upload_date": "2025-12-21 06:12:54",
        "path": "uploaded_docs/Module_ownership.txt",
        "summary": "Here's a summary of the provided project document:\n\n### Project Document Summary: Module Ownership\n\nThis document outlines the designated ownership and support structure for key system modules.\n\n1.  **Purpose of the Document:**\n    The primary purpose of this document is to clearly define the individuals responsible for the ownership and backup support of specific system modules, ensuring accountability and clear points of contact for each.\n\n2.  **Key Processes Described:**\n    While not detailing a procedural process, the document effectively *establishes* the assignment of ownership and backup responsibilities for critical modules. It formalizes who is accountable for each module.\n\n3.  **Important Contacts / Ownership:**\n    *   **Order Intake Module:**\n        *   Owner: Hari\n        *   Backup: Aruna\n    *   **Payment Module:**\n        *   Owner: Meena\n        *   Backup: None\n    *   **Reporting Module:**\n        *   Owner: Shree\n        *   Business Contact: Finance Team\n\n4.  **Key Decisions Made:**\n    *   Hari has been assigned as the owner for the Order Intake Module, with Aruna designated as the backup.\n    *   Meena has been assigned as the owner for the Payment Module, with no backup currently specified.\n    *   Shree has been assigned as the owner for the Reporting Module, and the Finance Team has been identified as its primary business contact.",
        "content": "Module Ownership\n\nOrder Intake Module:\n- Owner: Hari\n- Backup: Aruna\n\nPayment Module:\n- Owner: Meena\n- Backup: None\n\nReporting Module:\n- Owner: Shree\n- Business Contact: Finance Team\n"
    },
    {
        "filename": "Backend_README.txt",
        "uploaded_by": "vijayashree2k04@gmail.com",
        "upload_date": "2025-12-21 06:14:40",
        "path": "uploaded_docs/Backend_README.txt",
        "summary": "This document, the \"Backend Service README,\" serves as a foundational guide for developers to understand, set up, and run the backend service locally. It outlines the necessary steps to get the development environment operational and provides key architectural and operational guidelines.\n\n**1. Purpose of the document:**\nThe primary purpose of this document is to provide essential instructions for setting up and running the backend service in a local development environment. It also serves as a quick reference for the repository's structural organization and highlights critical operational policies.\n\n**2. Key processes described:**\nThe document details the following key processes:\n*   **Local Setup:** A step-by-step guide for getting the service running locally, including cloning the repository, creating a virtual environment, installing dependencies, configuring environment variables, and executing the service.\n*   **Code Navigation:** Outlines the repository's structure, indicating the location of API routes (`/api`), core business logic (`/services`), and shared utility functions (`/utils`).\n\n**3. Important contacts / ownership:**\nThe provided document content does not specify any important contacts or ownership details for the backend service.\n\n**4. Key decisions made:**\nTwo critical operational decisions or policies are clearly stated:\n*   **Secret Management:** Secrets must never be committed to the repository, emphasizing a strong security practice.\n*   **Local Testing Data:** Local testing environments should exclusively use test data, implying that real or production data should not be utilized during local development.",
        "content": "Backend Service README\n\nSetup Instructions:\n1. Clone the repository.\n2. Create virtual environment.\n3. Install dependencies using requirements.txt.\n4. Set environment variables.\n5. Run the service locally.\n\nRepo Structure:\n- /api → API routes\n- /services → Business logic\n- /utils → Helper functions\n\nImportant Notes:\n- Never commit secrets.\n- Use test data for local testing.\n"
    },
    {
        "filename": "Deployment_Process.txt",
        "uploaded_by": "vijayashree2k04@gmail.com",
        "upload_date": "2025-12-21 22:48:39",
        "path": "uploaded_docs\\Deployment_Process.txt",
        "team_id": "team_1_1766335113.090421",
        "summary": "Here is a summary of the document:\n\n• This document outlines the standard operating procedure for code deployment across Dev, QA, and Production environments.\n• The deployment process starts by merging code to the main branch and triggering the CI pipeline.\n• Code is deployed to QA, where smoke tests are run, and requires subsequent approval from the Product Owner.\n• Production deployment must occur during non-peak hours, only after Product Owner approval.\n• Key ownership roles include the DevOps Team for the CI/CD Pipeline, the QA Lead for QA Approval, and the Tech Lead for Production Deployment.\n• In case of any deployment failures, the DevOps on-call engineer must be contacted immediately.",
        "content": "Deployment Process SOP\n\nEnvironment:\n- Dev\n- QA\n- Production\n\nSteps:\n1. Merge code to main branch.\n2. Trigger CI pipeline.\n3. Deploy to QA and run smoke tests.\n4. Get approval from Product Owner.\n5. Deploy to Production during non-peak hours.\n\nOwnership:\n- CI/CD Pipeline: DevOps Team\n- QA Approval: QA Lead\n- Production Deployment: Tech Lead\n\nEscalation:\nIf deployment fails, contact the DevOps on-call engineer.\n"
    },
    {
        "filename": "KT_Handover.txt",
        "uploaded_by": "vijayashree2k04@gmail.com",
        "upload_date": "2025-12-22 20:34:05",
        "path": "uploaded_docs\\KT_Handover.txt",
        "team_id": "team_1_1766335113.090421",
        "summary": "- This 3+ year project has significant implicit logic, requiring caution and awareness of undocumented processes.\n- Do not modify the validation module without informing the tech lead; production access is restricted.\n- Order retries are automated via a cron job, not handled manually.\n- Adding new order types involves updating schema, validation rules, and the Kafka topic; debug failures by checking GCP Order Processor service logs.\n- Be aware of intermittent Kafka lag during peak hours and legacy code within the payment module.\n- New joiners should note that configuration files are environment-specific and some logic is controlled by feature flags.",
        "content": "KT / Handover Notes\n\nOverview:\nThis project has been running for 3+ years. A lot of logic is implicit and not fully documented.\n\nImportant Things to Know:\n- Do not touch the validation module without informing the tech lead.\n- Order retries are handled via a cron job, not manually.\n- Production access is restricted.\n\nCommon Tasks:\n- Adding a new order type: Update schema, validation rules, and Kafka topic.\n- Debugging failures: Check logs in GCP → Order Processor service.\n\nKnown Issues:\n- Intermittent Kafka lag during peak hours.\n- Legacy code in payment module.\n\nThings New Joiners Usually Miss:\n- Config files are environment-specific.\n- Some logic is controlled via feature flags.\n"
    }
]